app/controllers/categories_controller.rb

	def index
		@categories = Category.paginate(page: params[:page], per_page: 3)
---
SELECT  "categories".* FROM "categories" LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"

	def create
		@category = Category.new(category_params)
		if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Sports"], ["created_at", "2019-09-05 07:56:42.764937"], ["updated_at", "2019-09-05 07:56:42.764937"]]